<a href="https://colab.research.google.com/github/ashgreat/r-basics/blob/main/mortgage_data_exploration.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

/content/drive/MyDrive/2020_bexar.csv

In [ ]:
import numpy as np

In [ ]:
import pandas as pd
loan_data = pd.read_csv("/content/drive/MyDrive/2020_bexar.csv")

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (22,23,24,26,27,28,29,30,31,32,33,38,43,44) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [ ]:
loan_data.head()

   activity_year  ... tract_median_age_of_housing_units
0           2020  ...                                11
1           2020  ...                                42
2           2020  ...                                39
3           2020  ...                                12
4           2020  ...                                14

[5 rows x 99 columns]

Get the first five observations for `action_taken`

In [ ]:
loan_data['action_taken'].head()

0    6
1    6
2    6
3    6
4    6
Name: action_taken, dtype: int64

Get the count of `action_taken`

In [ ]:
loan_data.sort_values(by = ['preapproval', 'loan_amount'])

In [ ]:
loan_data['action_taken'].value_counts()

1    71316
6    21456
4    21099
3    17580
5     9037
2     4737
8       35
7       13
Name: action_taken, dtype: int64

Create a new binary variable `action_taken_target` such that when `action_taken` is 1 or 2, the new variable is 1. Otherwise the new variable is 0.

In [ ]:
loan_data['action_taken_target'] = np.where(loan_data['action_taken'] <= 2, 1, 0)

Print the first

In [ ]:
loan_data[['action_taken', 'action_taken_target']].head()

   action_taken  action_taken_target
0             6                    0
1             6                    0
2             6                    0
3             6                    0
4             6                    0

Ascertain that we get 1s when `action_taken` is 1 or 2

In [ ]:
loan_data[['action_taken', 'action_taken_target']][loan_data['action_taken'] <= 2]

        action_taken  action_taken_target
301                1                    1
304                1                    1
305                1                    1
306                2                    1
308                1                    1
...              ...                  ...
144873             1                    1
144874             1                    1
144876             1                    1
144877             1                    1
144892             1                    1

[76053 rows x 2 columns]

In [ ]:
loan_data[['action_taken', 'action_taken_target']][loan_data['action_taken'] == 7]

        action_taken  action_taken_target
551                7                    0
16089              7                    0
16377              7                    0
16379              7                    0
22081              7                    0
38052              7                    0
38055              7                    0
38097              7                    0
99864              7                    0
100061             7                    0
100087             7                    0
100868             7                    0
135352             7                    0

Get the mean of `total_loan_costs`

In [ ]:
type(loan_data['total_loan_costs'])

pandas.core.series.Series

In [ ]:
loan_data.dtypes

activity_year                         int64
lei                                  object
derived_msa_md                        int64
state_code                           object
county_code                           int64
                                      ...
tract_to_msa_income_percentage        int64
tract_owner_occupied_units            int64
tract_one_to_four_family_homes        int64
tract_median_age_of_housing_units     int64
action_taken_target                   int64
Length: 100, dtype: object

In [ ]:
loan_data['total_loan_costs'].dtypes

dtype('O')

In [ ]:
loan_data['total_loan_costs']

0         6266.76
1          2662.7
2         4033.44
3          1868.5
4         7610.72
           ...
145268    2207.13
145269    2048.88
145270    1409.58
145271    6018.37
145272    4976.12
Name: total_loan_costs, Length: 145273, dtype: object

In [ ]:
loan_data['total_loan_costs'].mean()

TypeError: ignored

In [ ]:
loan_data['total_loan_costs_num'] = pd.to_numeric(loan_data['total_loan_costs'], errors='coerce')

In [ ]:
loan_data['total_loan_costs_num'].mean()

5319.932977025057

In [ ]:
loan_data['total_loan_costs_num'].describe()

count     81437.000000
mean       5319.932977
std        3778.456877
min           0.000000
25%        3020.390000
50%        4683.000000
75%        7144.960000
max      320795.000000
Name: total_loan_costs_num, dtype: float64

Get the loan costs by `loan_type`

In [ ]:
loan_data.groupby('loan_type')['total_loan_costs_num'].mean()

loan_type
1    4481.031392
2    7556.114720
3    5159.691972
4    6414.933910
Name: total_loan_costs_num, dtype: float64

In [ ]:
loan_data.groupby('loan_type')['total_loan_costs_num'].describe()

             count         mean          std  ...      50%       75%        max
loan_type                                     ...
1          40661.0  4481.031392  2896.635865  ...  4185.40  5669.400  100000.00
2          16564.0  7556.114720  3847.603363  ...  7458.21  9106.215  320795.00
3          23455.0  5159.691972  4427.877232  ...  3950.50  7077.145  100613.68
4            757.0  6414.933910  2147.945009  ...  6232.19  7540.520   15364.19

[4 rows x 8 columns]

Create dummy variables or one-hot encoded variables

In [ ]:
loan_type_df = pd.get_dummies(loan_data['loan_type'], prefix = 'loan_type')
loan_type_df.head()

   loan_type_1  loan_type_2  loan_type_3  loan_type_4
0            1            0            0            0
1            1            0            0            0
2            0            0            1            0
3            1            0            0            0
4            0            1            0            0

Add back the dummies to the original data frame. Here we are using `concat()` method which can join data frames by row (this is the default with `axis = 0`) and columns (`axis = 1`).
This will just attach the data sets without a common "key" or "index".

In [ ]:
loan_data2 = pd.concat([loan_data, loan_type_df], axis=1)

Joining data sets using a common key.

For this, let's first create a data frame with the means of `total_loan_costs_num` for each `loan_type`.

Note that in the code below, I have changed the name of the column that holds the means. This is because in the original dataframe we have the same column but with different values. We don't want to overwrite that.

In [ ]:
loan_type_means = loan_data.groupby('loan_type')['total_loan_costs_num'].mean()
loan_type_means = pd.DataFrame(loan_type_means).rename(columns = {"total_loan_costs_num": "total_loan_costs_mean"})
loan_type_means

           total_loan_costs_mean
loan_type
1                    4481.031392
2                    7556.114720
3                    5159.691972
4                    6414.933910

Next, we are ready to do the join. In `pandas` it is done using `merge()`method.

In [ ]:
loan_data3 = pd.merge(loan_data, loan_type_means, on = 'loan_type', how = 'inner')

In [ ]:
loan_data3[['loan_type', 'total_loan_costs_num', 'total_loan_costs_mean']].head()

   loan_type  total_loan_costs_num  total_loan_costs_mean
0          1               6266.76            4481.031392
1          1               2662.70            4481.031392
2          1               1868.50            4481.031392
3          1               2537.15            4481.031392
4          1               8002.43            4481.031392

In [ ]:
loan_data3[['loan_type', 'total_loan_costs_num', 'total_loan_costs_mean']][loan_data3['loan_type'] == 2].head()

        loan_type  total_loan_costs_num  total_loan_costs_mean
114929          2               7610.72             7556.11472
114930          2               4740.72             7556.11472
114931          2               7247.97             7556.11472
114932          2               5578.98             7556.11472
114933          2               4859.05             7556.11472

Read more about joins here: https://www.analyticsvidhya.com/blog/2020/02/joins-in-pandas-master-the-different-types-of-joins-in-python/